{
	"id": 5101138008,
	"company": "circleso",
	"type": null,
	"title": "Senior Machine Learning Engineer, Discover",
	"description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 200 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;\n&lt;p&gt;Check out our&amp;nbsp;&lt;a class=&quot;c-link&quot; href=&quot;https://careers.circle.so/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://careers.circle.so/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Careers&lt;/a&gt; page for more about working at Circle.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;We’re building something game-changing at Circle:&lt;/strong&gt; a discovery marketplace where millions can find creators, communities, and products to help them achieve their highest personal and professional goals.&lt;/p&gt;\n&lt;p&gt;You’ll help build the foundation for the recommendation engine behind the feed and marketplace for Discover. Think of a Pinterest, Reddit or Instagram-style product, reimagined with a mission to help people achieve their goals instead of distracting them with endless doom scrolling. Through Discover, you will be building technology that could help millions of people grow, self-actualize, and live their best lives.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Help build the discovery feed — the core recommendations engine that powers how consumers find creators, products, and communities that help them grow.&lt;/li&gt;\n&lt;li&gt;Partnering closely with Circle’s CEO and co-founders to execute on a vision that redefines discovery in the creator economy.&lt;/li&gt;\n&lt;li&gt;Designing, implementing, and iterating on large-scale ML systems — from embeddings and ranking models to experimentation frameworks — to reach product/market fit.&lt;/li&gt;\n&lt;li&gt;Using data, experimentation, and engineering intuition to make fast, high-quality decisions that unlock transformational consumer experiences.&lt;/li&gt;\n&lt;li&gt;Obsessing over the craft, quality, and performance of the algorithms that turn Circle Discover into a household name.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of hands-on software engineering experience, with &lt;strong&gt;at least 2+ years focused on machine learning, data, or recommendation systems&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Experience building or scaling feeds, ranking systems, or large-scale consumer-facing ML products.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in backend and data engineering skills — from system design to productionizing ML models.&lt;/li&gt;\n&lt;li&gt;Deep understanding of consumer app dynamics and what drives product/market fit in discovery and recommendation experiences.&lt;/li&gt;\n&lt;li&gt;The curiosity and drive to learn fast, experiment aggressively, and thrive in a highly dynamic environment.&lt;/li&gt;\n&lt;li&gt;Comfortable in a fast-paced environment with a certain level of ambiguity, especially when learning and picking up new technologies when projects require it.&lt;/li&gt;\n&lt;li&gt;Strong alignment with our values,&amp;nbsp;&lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet.&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a&amp;nbsp;&lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$170,000 - $200,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;",
	"location": "Remote",
	"locations": [
		"Remote"
	],
	"isRemote": true,
	"isHybrid": false,
	"salary": {
		"min": 170000,
		"max": 200000,
		"currency": "USD",
		"raw": "$170,000 - $200,000"
	},
	"department": "Engineering",
	"metadata": {},
	"postingUrl": "https://job-boards.greenhouse.io/circleso/jobs/5101138008",
	"applyUrl": "https://job-boards.greenhouse.io/circleso/jobs/5101138008",
	"publishedAt": "2026-01-29T10:00:44-05:00"
}