{
	"id": 5072720008,
	"company": "circleso",
	"type": null,
	"title": "Customer Success Manager, Circle Plus",
	"description": "&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 200 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;\n&lt;p&gt;Check out our&amp;nbsp;&lt;a class=&quot;c-link&quot; href=&quot;https://careers.circle.so/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://careers.circle.so/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Careers&lt;/a&gt; page for more about working at Circle.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p data-start=&quot;422&quot; data-end=&quot;785&quot;&gt;There are over 12,000 paying communities powered by Circle, and that number is growing rapidly month over month. Our highest-tier offering, Circle Plus, is scaling especially quickly. Circle Plus customers launch fully branded mobile apps alongside their communities, and as a result, they receive a higher-touch level of service and partnership from our team.&lt;/p&gt;\n&lt;p data-start=&quot;787&quot; data-end=&quot;1198&quot;&gt;As a &lt;strong data-start=&quot;792&quot; data-end=&quot;836&quot;&gt;Customer Success Manager for Circle Plus&lt;/strong&gt;, you’ll serve as the primary point of contact for some of our most strategic customers, partnering closely with them to help them launch, grow, and scale successful communities. You’ll guide customers through onboarding and rollout, ensure strong product adoption across both web and mobile, and proactively help them unlock ongoing value from Circle over time.&lt;/p&gt;\n&lt;p data-start=&quot;1200&quot; data-end=&quot;1771&quot;&gt;This is a high-impact role with meaningful ownership. In addition to managing a book of Circle Plus customers end to end, you’ll play a role in shaping how Customer Success at Circle scales in the years ahead. You’ll help define best practices, test and build new processes, and work closely with Product, Engineering, Sales, and Support to deliver a consistently excellent customer experience. As a trusted advisor and advocate, you’ll also represent the voice of the customer internally, helping inform product decisions and broader business strategy.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll be helping our customers succeed in building an engaging community, and establishing yourself as a trusted advisor along their journey. Over the course of your first year you’ll ramp toward serving 100+ customers.&lt;/li&gt;\n&lt;li&gt;You will be responsible for onboarding 8-15 new customers per month, which typically entails delivering strategy and implementation guidance over a series of 6 or so meetings in their first 90 days as a customer. Following their successful launch, you’ll move to monthly or quarterly strategy sessions.&lt;/li&gt;\n&lt;li&gt;Develop strong relationships with both new and existing customers to understand their goals, and consult on the best ways to achieve them using Circle to drive product adoption, revenue growth and retention across your book of customers.&lt;/li&gt;\n&lt;li&gt;Analyze customer usage across your book of business to identify risks and opportunities, create accurate forecasts, then take ownership of designing and executing engagement campaigns to action against them.&lt;/li&gt;\n&lt;li&gt;Communicate thoughtfully with your clients and internal stakeholders to ensure prompt answers that can be understood by both technical and non-technical recipients.&lt;/li&gt;\n&lt;li&gt;Maintain a deep understanding of the Circle platform, our branded app capabilities, and online community building strategies to make recommendations on how customers can accelerate their desired outcomes.&lt;/li&gt;\n&lt;li&gt;Partner closely with other internal stakeholders to share customer stories &amp;amp; experiences that help build deeper understanding of customers goals, use cases and outcomes.&lt;/li&gt;\n&lt;li&gt;Act as an internal advocate for customers by consistently contributing feedback to product &amp;amp; engineering on areas for improvement to enhance the customers experience&lt;/li&gt;\n&lt;li&gt;Contribute to the ongoing improvement of our customer success processes and methodologies&lt;/li&gt;\n&lt;li&gt;Working with customers through their renewal and re-consideration windows to help them understand how Circle can support their business strategy and future planning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;You either have 4+ years working directly with creators or a company in a community management role, or you have 4+ years of experience in SaaS Customer Success role, working with SMB customers to drive product adoptions, expansion, and retention.&lt;/li&gt;\n&lt;li&gt;You have experience serving customers and navigating the complexity of tight timelines, complex processes and managing relationships with multiple stakeholders both internally and externally.&lt;/li&gt;\n&lt;li&gt;You are comfortable learning and understanding business models across various industries/segments. You will often be driving the conversation to help your customers define what success means for their community.&lt;/li&gt;\n&lt;li&gt;You have a growth mindset and are willing to share and receive feedback in a constructive, respectful, and empathetic manner. We care deeply about getting better as individuals and as a team every day.&lt;/li&gt;\n&lt;li&gt;You&#39;re driven &amp;amp; process-oriented. You’re able to effectively balance competing priorities and make decisions that best support the customer, the team, and Circle.&lt;/li&gt;\n&lt;li&gt;You’re able to switching contexts throughout the day, from responding to customer emails, to leading a product training, to running a quarterly community review, to meeting with the Product team about an upcoming feature.&lt;/li&gt;\n&lt;li&gt;You are a team player with a high level of integrity and desire to assist your team. When you find processes that work, you will document them through playbooks, teach others, and champion wider adoption.&lt;/li&gt;\n&lt;li&gt;You have an aptitude for digesting and effectively communicating technical concepts across audiences of varying technical ability.&lt;/li&gt;\n&lt;li&gt;You’re resourceful. You may not have all the answers, but you know how to find them.&lt;/li&gt;\n&lt;li&gt;You&#39;re a self-motivated, proactive team player. You bias towards action and work effectively in a highly ambiguous, ever-changing environment. You’re able to hone in on granular details and also take a step back to understand the larger strategy and philosophy of how and why decisions are made.&lt;/li&gt;\n&lt;li&gt;You have experience leveraging product usage data in your approach to engaging, expanding, and prioritizing your accounts.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity and proficiency with HubSpot, Zapier, Notion, Canva, Google Suite.&lt;/li&gt;\n&lt;li&gt;Experience serving and working with successful creators.&lt;/li&gt;\n&lt;li&gt;Familiarity with the Circle product already.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$110,000 - $120,000 USD OTE per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;This role includes variable compensation at approximately 85% base, 15% variable.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;",
	"location": "Remote",
	"locations": [
		"Remote"
	],
	"isRemote": true,
	"isHybrid": false,
	"salary": {
		"min": 110000,
		"max": 120000,
		"currency": "USD",
		"raw": "$110,000 - $120,000"
	},
	"department": "Customer Success",
	"metadata": {},
	"postingUrl": "https://job-boards.greenhouse.io/circleso/jobs/5072720008",
	"applyUrl": "https://job-boards.greenhouse.io/circleso/jobs/5072720008",
	"publishedAt": "2026-01-19T19:38:58-05:00"
}